docs: restructure documentation (#61)
